# **SQL Exercise**

## **Activity 1** 

Practice performing CRUD operations (Create, Read, Update, Delete) on a database table.

### **Perform the following tasks:**

In [4]:
import sqlite3

1. Connect to the database `abc_corp.db` and create the cursor.

In [5]:
conn = sqlite3.connect('abc_corp.db')
cursor = conn.cursor()

2. `Create` a new table named books, with the following columns:
  * book_id (primary Key)
  * title (Title of the book)
  * author (Author of the book)
  * genre (Genre of the book)
  * publication_year (Year of publication)
  * price (Price of the Book)

In [6]:
cursor.execute(
"""
    CREATE TABLE IF NOT EXISTS books (
    book_id INTEGER PRIMARY KEY AUTOINCREMENT,
    title VARCHAR(100) NOT NULL,
    author VARCHAR(100) NOT NULL,
    genre VARCHAR(50),
    publication_year INTEGER,
    price DECIMAL(8, 2) NOT NULL
    )
"""
)
conn.commit()

3. `Insert` at least 5 new books into the books table.

In [ ]:

cursor.execute(
"""
INSERT INTO books (book_id, title, author, genre, publication_year, price) VALUES
(5, 'The Great Gatsby', 'F. Scott Fitzgerald', 'Classic', 1925, 10.99),
(7, 'The Hobbit', 'J.R.R. Tolkien', 'Fantasy', 1937, 13.50),
(9, 'The Alchemist', 'Paulo Coelho', 'Adventure', 1988, 12.99),
(11, 'The Catcher in the Rye', 'J.D. Salinger', 'Coming-of-age', 1951, 11.75),
(13, 'Harry Potter and the Sorcererâ€™s Stone', 'J.K. Rowling', 'Fantasy', 1997, 15.99);
""")
conn.commit()

4. `Retrieve` all books from the books table.

In [ ]:
cursor.execute("SELECT * FROM books")
cursor.fetchall()

[(1, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 14.99),
 (3, 'Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 7.99),
 (5, 'The Great Gatsby', 'F. Scott Fitzgerald', 'Classic', 1925, 10.99),
 (7, 'The Hobbit', 'J.R.R. Tolkien', 'Fantasy', 1937, 13.5),
 (9, 'The Alchemist', 'Paulo Coelho', 'Adventure', 1988, 12.99),
 (11, 'The Catcher in the Rye', 'J.D. Salinger', 'Coming-of-age', 1951, 11.75)]

5. `Update` the price of a specific book.

In [ ]:
cursor.execute("""
    UPDATE books 
    SET title = 'Harry Potter and the Prisoner of Azkaban', 
        publication_year = 1999, 
        price = 13.99
    WHERE book_id = 13
""")
conn.commit()

6. `Delete` a book from the table.

In [ ]:
cursor.execute("DELETE FROM books WHERE book_id = 13")
conn.commit()

## **Activity 2** 

Practice using SQL queries with LIMIT, COUNT, and WHERE Clause along with comparison, logical, and special operators.

### **Perform the following tasks:**

1. Create a table named `Students` and add these columns:
  * **student_id** : This column stores the unique identifier for each student, serving as the primary key of the table.
  * **name** : It holds the full name of the student, allowing for the storage of both the first name and last name within a maximum length of 50 characters.
  * **age** : This column represents the age of the student in years, stored as an integer value.
  * **gender** : It stores the gender of the student, allowing for the classification as either "Male" or "Female" within a maximum length of 10 characters.
  * **grade** : This column holds the grade level of the student, typically represented by a single character such as 'A', 'B', 'C', 'D', indicating academic performance or class standing.

In [40]:
cursor.execute(
"""
    CREATE TABLE IF NOT EXISTS Students (
    student_id INTEGER PRIMARY KEY AUTOINCREMENT,
    name VARCHAR(50) NOT NULL,
    age INTEGER,
    gender VARCHAR(10),
    grade CHAR(1)
    )
"""
)
conn.commit()

2. Insert the provided data below into the students table.

| student_id | name             | age | gender | grade |
| ---------- | ---------------- | --- | ------ | ----- |
| 1          | John Di          | 18  | Male   | A     |
| 2          | Emily Clark      | 17  | Female | B     |
| 3          | Michael Santos   | 19  | Male   | C     |
| 4          | Sarah Davis      | 16  | Female | A     |
| 5          | David Poms       | 18  | Male   | B     |
| 6          | Jessica Parker   | 17  | Female | A     |
| 7          | Matthew Ross     | 19  | Male   | D     |
| 8          | Ashey Lim        | 18  | Female | C     |
| 9          | Christopher Chen | 17  | Male   | D     |
| 10         | Amanda Hanes     | 16  | Female | B     |

In [41]:
cursor.execute(
"""
INSERT INTO Students (name, age, gender, grade) VALUES
('John Di', 18, 'Male', 'A'),
('Emily Clark', 17, 'Female', 'B'),
('Michael Santos', 19, 'Male', 'C'),
('Sarah Davis', 16, 'Female', 'A'),
('David Poms', 18, 'Male', 'B'),
('Jessica Parker', 17, 'Female', 'A'),
('Matthew Ross', 19, 'Male', 'D'),
('Ashey Lim', 18, 'Female', 'C'),
('Christopher Chen', 17, 'Male', 'D'),
('Amanda Hanes', 16, 'Female', 'B');

""")
conn.commit()

In [52]:
cursor.execute("SELECT * FROM Students;")
cursor.fetchall()

[(1, 'John Di', 18, 'Male', 'A'),
 (2, 'Emily Clark', 17, 'Female', 'B'),
 (3, 'Michael Santos', 19, 'Male', 'C'),
 (4, 'Sarah Davis', 16, 'Female', 'A'),
 (5, 'David Poms', 18, 'Male', 'B'),
 (6, 'Jessica Parker', 17, 'Female', 'A'),
 (7, 'Matthew Ross', 19, 'Male', 'D'),
 (8, 'Ashley Lim', 18, 'Female', 'C'),
 (9, 'Christopher Chen', 17, 'Male', 'D'),
 (10, 'Amanda Hanes', 16, 'Female', 'B')]

3. Retrieve only the name and grade columns for all students.

In [53]:
cursor.execute("SELECT name, grade FROM Students;")
cursor.fetchall()

[('John Di', 'A'),
 ('Emily Clark', 'B'),
 ('Michael Santos', 'C'),
 ('Sarah Davis', 'A'),
 ('David Poms', 'B'),
 ('Jessica Parker', 'A'),
 ('Matthew Ross', 'D'),
 ('Ashley Lim', 'C'),
 ('Christopher Chen', 'D'),
 ('Amanda Hanes', 'B')]

4. Retrieve male students older than 18 years old.

In [54]:
cursor.execute("SELECT name, age FROM Students WHERE gender = 'Male' AND age > 18")
cursor.fetchall()

[('Michael Santos', 19), ('Matthew Ross', 19)]

5. Retrieve the name and age of students who are older than or equal to 18.

In [55]:
cursor.execute("SELECT name, age FROM Students WHERE age >= 18")
cursor.fetchall()

[('John Di', 18),
 ('Michael Santos', 19),
 ('David Poms', 18),
 ('Matthew Ross', 19),
 ('Ashley Lim', 18)]

6. Retrieve the name and gender of students who are either 16 years old or have a grade of 'A'.

In [56]:
cursor.execute("SELECT name, gender, age, grade FROM Students WHERE age = 16 OR grade = 'A';")
cursor.fetchall()

[('John Di', 'Male', 18, 'A'),
 ('Sarah Davis', 'Female', 16, 'A'),
 ('Jessica Parker', 'Female', 17, 'A'),
 ('Amanda Hanes', 'Female', 16, 'B')]

7. Retrieve the name, age, and grade of female students who are younger than 18.

In [57]:
cursor.execute("SELECT name, age, grade FROM Students WHERE gender = 'Female' AND age < 18;")
cursor.fetchall()

[('Emily Clark', 17, 'B'),
 ('Sarah Davis', 16, 'A'),
 ('Jessica Parker', 17, 'A'),
 ('Amanda Hanes', 16, 'B')]

8. Retrieve the count of male students.

In [58]:
cursor.execute("SELECT COUNT(*) FROM Students WHERE gender = 'Male';")
cursor.fetchall()

[(5,)]

9. Retrieve the students who are between 16 or 19 years old.

In [59]:
cursor.execute("SELECT * FROM Students WHERE age IN (16, 19);")
cursor.fetchall()

[(3, 'Michael Santos', 19, 'Male', 'C'),
 (4, 'Sarah Davis', 16, 'Female', 'A'),
 (7, 'Matthew Ross', 19, 'Male', 'D'),
 (10, 'Amanda Hanes', 16, 'Female', 'B')]

10. Retrieve the name and grade of students whose grades are 'B' or 'C' and are older than or equal to 18 years old.

In [60]:
cursor.execute("SELECT name, grade FROM Students WHERE grade IN ('B', 'C') AND age >= 18;")
cursor.fetchall()

[('Michael Santos', 'C'), ('David Poms', 'B'), ('Ashley Lim', 'C')]

11. Retrieve the name and age of students whose names start with 'A'.

In [68]:
cursor.execute("SELECT name, age FROM Students WHERE name LIKE 'A%';")
cursor.fetchall()

[('Ashley Lim', 18), ('Amanda Hanes', 16)]

12. Retrieve the first 5 students whose names contain the letter 'i'.

In [69]:
cursor.execute("SELECT * FROM Students WHERE name LIKE '%i%';")
cursor.fetchall()

[(1, 'John Di', 18, 'Male', 'A'),
 (2, 'Emily Clark', 17, 'Female', 'B'),
 (3, 'Michael Santos', 19, 'Male', 'C'),
 (4, 'Sarah Davis', 16, 'Female', 'A'),
 (5, 'David Poms', 18, 'Male', 'B'),
 (6, 'Jessica Parker', 17, 'Female', 'A'),
 (8, 'Ashley Lim', 18, 'Female', 'C'),
 (9, 'Christopher Chen', 17, 'Male', 'D')]